[
                      [
                                            "2023-07-25 05:57:45",
                                            "b'Im in my early 20s in college and devout about 70% of my paycheck into 5 stocks, like the title says: TSLA, AMZN, MSFT, GOOGL, and APPL.\\n\\nWhy does this feel like a both good and bad long term strategy of investing? On one side, I cant see these stocks going anywhere, tech only will expand, and even if tech stocks crash, these stocks seem to be able to extend beyond just tech, ie TSLA with cars, AMZN with grocery stores, APPL with, well, phones and computers, Microsoft seemingly expanding to being a company that branches far past tech, and even Google even though operation as a search engine seems to have and will continue to cement themselves as a leading corporation in America.\\n\\nOf course, Im not saying anything special. Im just wondering, is this a foolish plan? I know diversification is important, but it seems just dumping as much as I can in these stocks for the next 20 years is a solid investment strategy that should enable me to become financially free and eligible for ret'"
                      ],
                      [
                                            "2023-07-21 16:05:22",
                                            "b'I gambled bad. I bought august 18 calls the day after earnings. Theyre down like 15k (50% right now). Ive lost so quicklyI should have sold today to salvage what I have but I cant bring myself to realize that loss. \\n\\nI dont play Tesla much. I know it has a lot of energy and tends to run.  Im wondering if anyone here has any idea if it can run to $290-$295 by time my calls expire. \\n\\nThis really sucks.'"
                      ],
                      [
                                            "2021-10-25 11:16:12",
                                            "b'So yes, this just happened, not sure what to say other than congrats on the gains to all the holders\\n\\nThis is incredible achievement and I am still not sure what is causing this. It took tech companies decades and many many successful products to reach this milestone while TSLA just breeze through it. Seems like market will never trade TSLA sideway so it can grow into the valuation but rather expanding it at this level. \\n\\nWhat are your thoughts on this feat.?\\n\\nhttps://i.imgur.com/8kOZdYq.jpg'"
                      ],
                      [
                                            "2022-07-12 11:28:34",
                                            "b'Everywhere is reporting that Musk now has a \"massive windfall that dwarfs any bitcoin losses\" due to the sale of the TSLA stock to fund the TWTR deal, and as that deal is no longer going ahead, he\\'s pockets the cash.\\n\\nI\\'m then reminded that some shrewd analysts suggested that the divorces of Bezos and Gates to their wives were actually cover to sell massive amounts of stocks without causing a run on their companies (Founders selling huge chunks of stock usually causes investors to shit it but can be explained away for personal reasons).\\n\\nI\\'m starting to think that Elon knows he\\'s got a tough road ahead, the golden days of Tesla stock price are behind him and he\\'s just liquidated massive amounts of stock at what will seem like a really high price in 10 years from now as all the big car manufacturers finally catch up and dilute Tesla\\'s only real advantage (being first).\\n\\nEDIT: wow, RIP my inbox and thanks for all the comments. \\n\\nOne comment in particular really seems to confirm the above'"
                      ],
                      [
                                            "2021-11-07 12:03:49",
                                            "b\"Let's just remember that the majority of TSLA poll voters (like me) are not even stockholders. Heck, I am not even a USA citizen... Why the majority of random internet users should even decide on such an important matter which will affect the majority of real stockholders?\""
                      ],
                      [
                                            "2020-06-10 09:37:29",
                                            "b\"TESLA is plowing through naysayers like a mf'n Semi!\\n\\nSo much ragrat, but I'm happy for them.\""
                      ],
                      [
                                            "2021-09-07 06:50:26",
                                            "b'Elon Musk told employees that he agrees with Ark Invest that Tesla (TSLA) is worth $3,000 a share if they execute really well. The CEO has often commented on Teslas stock price, but surprisingly, it was often to say that the price was too high. \\n\\nIn 2020, when Teslas stock was reaching new high, Musk told his millions of followers on Twitters that he believed the stock was too high. It sent Teslas stock crashing, but now it is even higher than when Musk made the comment.\\n\\nTesla is currently trading at $733 a share and the automaker is the most valuable automotive company in the world at over $730 billion.\\n\\nWall Street firms are divided on whether or not the company is overvalued, but a few of them believe that Tesla could be worth a lot more. Ark Invest is one of them. Though to be fair, the company is also a large Tesla shareholders through its investment funds.\\n\\nThis week, they released a new note claiming a $3,000 base stock price target by 2025 for Tesla. Cathie Wood said ab'"
                      ],
                      [
                                            "2022-12-23 18:56:55",
                                            "b\"Been a TSLA investor since 2017. This week I made the decision to pull out of the company (over 1,500 shares). After being up 800%+ at one point, I left after it came crashing back down to ~180%. I did not incur a loss, I am just not walking away with retirement levels of money that I could have possibly walked away with a mere year ago. Dumb? Maybe. Did I need to sell? No. Does it give me peace? Absolutely.\\n\\nBeing a TSLA investor was interesting. Elon has always been Elon and I believe the company is indeed positioned for long-term growth (even now). There were plenty of ups and downs, but I never 'doubted my vibe' and the Elon antics up until the latter half of 2022 I would have described almost as eccentric. The guy was an idiot from time to time, but was definitely doing something right. Tesla is competitive, innovative, and is a leader in the EV space. Long-term, the company has a ton of upward potential. Emphasis on the word 'potential.' \\n\\nHowever, there has been a change. Things\""
                      ],
                      [
                                            "2022-02-26 18:27:48",
                                            "b'Basically the title.\\n\\nUkraine requested Starlink access to defeat Russian attempts to disconnect them from the net.\\n\\nMusk responded that service is now online, and \"more terminals are on the way\", suggesting terminals had already been delivered.\\n\\nNow as we know, Ukraine is being attacked by Russia, and Russia warned against intervention. Well, Musk just intervened.\\n\\nThis likely invites backlash from Russia, and their allies against TSLA doesn\\'t it?'"
                      ],
                      [
                                            "2023-06-15 12:26:08",
                                            "b'This is the first ruling of an appellate court in Europe against Tesla. The ruling by the Antwerp court rips apart Teslas auto pilot functions and cites multiple severe deficiencies like unwanted stoppages. The court also criticized Tesla for obstructing the investigation https://www.handelsblatt.com/unternehmen/industrie/gerichtsurteil-in-belgien-tesla-muss-fahrzeug-zuruecknehmen/29207716.html'"
                      ],
                      [
                                            "2022-11-08 15:06:58",
                                            "b\"I am up alot more than the average person. I have been almost up 500% with this stock. Right now, Elon is consistently making decisions which I don't agree with. I've supported him for a while and right now I don't know what to do.\\n\\nI am still up 300%. I've sold a few shares over the years. I've been holding since 2019. I still think he is changing the world, but his personality and actions go against the person who I first invested in.\""
                      ],
                      [
                                            "2022-01-27 13:21:34",
                                            "b\"Well most of the time we post on what we missed losing for selling too early or buying too high; Sometimes we have to recognize what we did right or in my case, how lucky I got.  Two weeks ago I received a $250k check from a house we sold.  It'll be a while before we need it, so I thought- what the hell- I should be able to make a quick buck instead of just leaving it in savings.  I deposited it to my brokerage account and I tried to buy 225 shares of TSLA at $1,115 or so thinking it would go back to $1200 in no time.  My broker blocked the sale because of the waiting period before I could use the funds.  I watched as the price went up a little bit so I was pissed.. then I watched it go down and down and down.. so even thought I could trade, I waited instead.  \\n\\nTLTR: My broker saved me from at least a $60k error because I couldn't use the funds when I wanted to.\""
                      ],
                      [
                                            "2020-10-21 13:14:06",
                                            "b'Tesla (TSLA) beats Q3 expectations, reports 5th straight profitable quarter.\\n\\nHere is how Tesla performed versus analyst expectations:\\n\\n* **Earnings per share (adjusted):** $0.76 vs $0.57 (estimate)\\n* **Revenue:** $8.77 billion vs $8.36 billion (estimate)\\n\\nThe company reiterated guidance to hit 500,000 deliveries in 2020.  \\n\\nTesla also kept its sales guidance for 2020, saying in a letter to investors that while its goal has become more difficult, delivering half a million vehicles in 2020 remains our target.\\n\\nSource: CNBC Now and smp-500.com'"
                      ],
                      [
                                            "2020-11-19 00:19:49",
                                            "b\"A good read for those invested in Tesla or potential investors.\\n\\n>\\tThere are only 25 companies listed on US exchanges big enough to not reach the threshold, and Berkshire Hathaway owns nine of them and is one of them.\\n\\n>\\tBuffett would actually be one of the last investors I would have thought would be buying into Tesla. \\n   \\tHe generally invests in fundamentals, and you dont invest into Tesla based on fundamentals. \\n   \\tHowever, he is toward the end of his career and slowly letting go of the reins at Berkshire Hathaway, and maybe other leaders at the firm like Tesla?\\n\\n@FrankPeelon did point something out:\\n\\n>\\tFrank Peelen found that about 50 million Tesla (TSLA) shares have disappeared into the hands of currently unknown investors based on the 13F filings, which disclose large ownerships\\n\\n>\\tI made a small mistake, so the number is actually a little over 50M shares, but nonetheless this is a large number of shares that can't be explained away by retail buying, delta hedging, and smaller\""
                      ],
                      [
                                            "2022-05-22 10:41:59",
                                            "b'1. Self driving being exposed as fraud by new documentary [mainstream press](https://www.npr.org/2022/05/20/1100022168/elon-musks-crash-course-new-york-times-fx-hulu-twitter-tesla-self-driving-cars) ?\\n2. TSLA booted from ESG index\\n3. Ongoing Twitter fiasco\\n4. [Sexual misconduct coverup exposed](https://www.businessinsider.com/spacex-paid-250000-to-a-flight-attendant-who-accused-elon-musk-of-sexual-misconduct-2022-5) ?\\n5. [Another Telsa crash death being investigated by NHTSA](https://www.yahoo.com/lifestyle/tesla-crash-california-under-investigation-135120830.html)\\n\\nBonus:  Right wing political stance [alienating largely Democratic customer base?](https://www.cnbc.com/2022/05/20/tesla-boss-elon-musk-blasts-biden-democrats-on-twitter-.html)\\n\\n&#x200B;\\n\\nThis is good for TSLA, right?   LOL'"
                      ],
                      [
                                            "2022-06-29 10:14:26",
                                            "b'Tesla is closing its office in San Mateo, California, and eliminating an estimated 200 jobs there, CNBC has confirmed, as part of a broader cost-cutting effort at the electric vehicle company.\\n\\nAt the San Mateo facility, hundreds of employees were tasked with labeling videos from the companys cars in order to improve their driver assistance systems, marketed as Autopilot. Bloomberg first reported on the office closure and layoffs.\\n\\nTwo employees impacted by the layoffs told CNBC on Tuesday that they knew Teslas lease was approaching its end. The workers asked not to be named because they werent authorized to speak on the matter.\\n\\nSource: [https://www.cnbc.com/2022/06/28/tesla-cutting-200-jobs-closing-autopilot-office-in-san-mateo.html](https://www.cnbc.com/2022/06/28/tesla-cutting-200-jobs-closing-autopilot-office-in-san-mateo.html)\\n\\n**Tesla (TSLA) fell back below $700 yesterday after announcing that it is cutting about 200 Autopilot jobs and closing its office in San Mateo, Califor'"
                      ],
                      [
                                            "2021-10-29 13:17:01",
                                            "b\"Post says it all.  TSLA is now worth $1.1T after the Hertz announcement.  The market cap increased from $864B to the $1.1T in 4 days.  That's a total of $236B increase in less than a week. The four day increase alone is worth more than Ford, GM, Nissan, and Honda total market caps combined ($67B, $79B, $22B, & $54B respectively).  Four days....it increased by the size of some of the largest car producers in the US combined.  It's total market cap is nearly 5X those same companies combined (you could own each of them 5X with TSLA market cap).\\n\\nAll of that for a company that has less than $4b in operational income YTD, which by the way is about 8X less than the combined income generated by the aforementioned car producers.  To also put that into perspective, it is now worth more than Facebook by $150B (that's a whole AMD market cap) which has generated 10X the net income YTD.\\n\\nI'm not a bear or a bull, I'm just watching this from the sidelines at this point.  I just wanted to point out h\""
                      ],
                      [
                                            "2023-07-03 05:53:35",
                                            "b\"Tesla's success is attributed to robust demand and efficiency in production.\\r  \\n\\r  \\nTesla (TSLA) reported delivery numbers for the second quarter of 2023 that beat analysts' expectations. The company delivered 466,140 vehicles in the quarter, up 83% year-over-year. Tesla also produced 479,700 vehicles in the quarter, up 71% year-over-year.\\r  \\n\\r  \\nThe strong delivery numbers were driven by strong demand for Tesla's vehicles. The company also added more manufacturing capacity in the quarter, including its new assembly plant in Austin, Texas.\\r  \\n\\r  \\nThanks to competitive pricing and factory production, Tesla looks set to hit a delivery goal of 1.8 million vehicles this year.\\r  \\n\\r  \\nOn July 19, Tesla will report its earnings.\""
                      ],
                      [
                                            "2022-08-07 10:00:32",
                                            "b\"Rant time: am I the only one who is tired of circle jerk around the same companies on this sub? \\n\\nThe fun part is that people who pick stocks like to mention how anyone would be 1000+% up if they picked Tesla, Netflix, AMD 5 years ago, etc. However, 5 years later they still pick the same stocks that turned into MEGA corporations and have far less room to grow.\\n\\nIt just shows how investors became lazy and stopped doing their research, which is never good. Companies like Meta and Intel are great examples how strongholds may fall one day and having all eggs in one basket with overvalued mega corporations is never a good thing.\\n\\nRant's over. What would be your favorite picks in today's market that look promising and have a great growth potential? Except for the well established big guys mentioned above.\""
                      ],
                      [
                                            "2022-02-20 16:31:37",
                                            "b'Bought TSLA at its last spike (1100) - my plan was just to ride the wave a bit and then sell it again. That never happened\\n\\nNow Im in the situation that I have to sit and wait for everything to get better. I would loose a lot of money, especially since I bought some extra shares on a credit base (thats the main reason why I cant just wait a few years for the stock to recover)\\n\\nIn order to maintain the hold on those stocks Id need to sell a few stocks again (sold already a few).\\n\\nWhat do you guys say - take the L and sell all TSLA or sell a few and hope that it recovers.'"
                      ],
                      [
                                            "2020-07-13 02:54:50",
                                            "b\"Hey guys and girls,\\n\\nI did some fundamental analysis on Tesla and I came to the conclusion that around 1000$ can be justified.\\n\\nTesla is at 1600$ now.\\n\\nIMHO we are entering bubble territory.\\n\\nWhat is your guys's and girls's opinion?\\n\\nDisclaimer: This is NOT financial advice. I'm no licensed financial advisor. Please consult one first before investing in the stock market.\\n\\nI am Long $TSLA.\""
                      ],
                      [
                                            "2021-10-01 12:43:18",
                                            "b\"      After months of weighing options I decided this was the best move for my family.\\n\\n      I've been in TSLA since 2015 when I decided to invest as a single mother,  and never sold even when times were hard. TSLA ended up being a huge blessing for me and my son over the years!\\n \\n        I made it through work being closed down for 9 months last year and half of this year, and never sold.     \\n       So, this step took alot for me, on a personal level.\\n\\n      Because of my job being effected half of this year, my income was no where close to what it would have normally been...       I decided that selling half would give me some peace of mind with the economic climate where it is. I also knew that with my income being as low as it was this year, that this was possibly the last opportunity to avoid selling in a higher tax bracket.\\n\\n        Of course, I had this mental struggle between selling and it then going higher.  But I've decided to just not let myself think on those terms.\\n    \""
                      ],
                      [
                                            "2022-01-24 21:20:46",
                                            "b\"A lot of people on this sub say Tesla is a great company but $1,000 is just not the right price.\\n\\nNow that there's a chance Tesla could go down pretty low, I wonder if there are people here who would like to initiate a position.\\n\\n* At what price point would you initiate a position in Tesla?\\n* Why this price point? \\n* How much are you looking to buy?\\n\\nTo be clear, I'm not looking for answers from Tesla bulls who thinks anything below $1,000 is a buying opportunity. I'm looking for people who are not in Tesla at all, and has been critical of it, but would be interested in getting in at a much lower price point.\\n\\n(Disclaimer: I've sold a put on Tesla at about $700 and might be looking to buy into Tesla sometime in next few weeks)\""
                      ],
                      [
                                            "2021-02-22 17:36:51",
                                            "b'Cathie Woods @ARKInvest added 273k shares of $TSLA today\\n\\n$ARKK - 184k shares  \\n\\n$ARKW - 62k shares  \\n\\n$ARKQ - 27k shares\\n\\n\\nCathie Wood &amp; @ARKInvest trade activity from today 2/22\\n\\nBought: $TSLA  $SPOT  $PYPL $FB $OPEN $SURF $RPTX $REGN $EXAS $CMLF $SGFY $U $TXG $TWTR $BEAM $FATE $RAVN $EXPC\\n\\nSold: $TWST $CDNA $ROKU $BIDU $TSM $MTLS $TCEHY $SSYS $SQ $HON $AVAV $ANSS $CRM $HUBS $SE\\n\\nsrc: https://cathiesark.com/ark-funds-combined/trades'"
                      ],
                      [
                                            "2022-11-17 22:36:27",
                                            "b\"Seems like after today there will be nearly no one left at twitter working. Entire teams quit. It might not collapse tomorrow but it'll be soon.\\n\\nI had a few thoughts, twitter going bankrupt and becoming worth nothing means Elon will need to pay back loans him self? He'll need to sell more of TSLA to do this, which should bring the price down?\\n\\nI think hes showing himself to be a bit insane and a terrible leader and the cult of elon that contributed to propping up tsla might disappear. A lack of confidence in the CEO could cause the stock price to drop in the future? \\n\\nThe market in general still isnt that great, stocks might just go down anyway.\\n\\nThinking of taking a gamble and maybe buying puts or shorting tsla. Dumb idea?\""
                      ],
                      [
                                            "2023-02-28 09:35:13",
                                            "b\"Rumors have been circulating for at least a couple months, but confirmed now by President Andres Manuel Lopez Obrador: Tesla is set to build a brand new plant in Monterrey, Mexico. This is a huge boost for Mexico, as it's trying to establish itself as a hub for investment by bringing manufacturing capacity to North America and away from Asia, thanks to geopolitical tensions and supply chain disruptions caused by the COVID-19 pandemic.\\n\\nLopez Obrador revealed that he had a call with Elon Musk on Monday, and they came to an agreement that will create lots of jobs and bring in a considerable investment. The President had previously expressed concerns over water shortages, but Musk was receptive and has accepted Mexico's proposals.\\n\\nThis investment is a big test for Mexico's President, who has a reputation for being a bit of a resource nationalist. Some companies have been unsettled by his efforts to strengthen state control of the energy market at the expense of private capital. But with \""
                      ],
                      [
                                            "2020-02-05 06:56:00",
                                            "b'Please STFU. Kudos on your gains and all but seriously, stop it.'"
                      ],
                      [
                                            "2021-02-12 13:37:10",
                                            "b'Elon Musk revealed that he has heard that Bill Gates had a big short position on Tesla (TSLA), and he might have lost a lot of money on it.\\n\\n\\n \\nBillionaires Musk and Gates dont always have good words to say about each other, but they do appear to share similar concerns about climate change.\\n\\nHowever, Gates made some strange comments about electrification last year, including that electric trucks, like the Tesla Semi, and electric airplanes will probably never work.\\n\\nIn a new interview on the Joe Rogan Experience, Musk was asked about those comments from gates.\\n\\nTeslas CEO responded:\\n\\nHe didnt know what he was talking about. Probably somebody told him that and he is just not that close to the physics of it. I dont think he is ill-intentioned here, I just think he doesnt know what he is talking about.\\n\\nHe added Tesla already has working prototypes of electric trucks that are transporting cargo  something that we already pointed out in our original report about Gates comment, i'"
                      ],
                      [
                                            "2021-10-15 05:22:31",
                                            "b'https://www.teslarati.com/tesla-tsla-jefferies-upgrade-demand-capacity/\\n\\nWe raise EBIT estimates 7-9% for 2022-23 and PT to $950 on higher capacity ramp and sustained demand, following further analysis of Q3 data and various sources of information on the soon-to-be-launched Berlin facility. For some time, the narrative has been legacy OEMs closing the gap; we see little evidence as Tesla continues to challenge at multiple levels. We raise EBIT and margin estimates in contrast with doubts about earnings momentum across legacy OEMs, Houchois wrote in a note.'"
                      ],
                      [
                                            "2020-01-08 10:32:51",
                                            "b\"I bought in sub 250 and sold out at 350. I'm hating my life right now\""
                      ],
                      [
                                            "2020-02-04 13:41:28",
                                            "b'Its been crazy. I bought 31 shares in 2017 at 362$ (11.200$). I hold because my mind is set 10-15 years into the future (1 trillion market cap). But today I decided to cover my first investment and sold 13 shares at 912$. It feels good to have 18 free shares. I think the price will come down eventually and I will buy back at some point. I have the dame feeling as I had with Beyond Meat (bought at 69$ and sold at 151$) at the beginning (only 1.500$ initial investment, a good profit).\\n\\nI am all in Tesla and share the same vision, but the hype, and the crazy rally is... too much.\\n\\nI wish you all the best!'"
                      ],
                      [
                                            "2022-01-28 11:02:59",
                                            "b\"You can't justify calculating TSLA's future value from the current numbers. You have to be expecting growth in sectors and markets not yet accessed by the company. That is eminently possible but with no information there is no reasonable way to estimate it. Your error bars are too large to create a valid result.\\n\\nYou also have to hope that the expected competition coming to the company's current sectors won't cause existing growth to slow. And that's not going to happen. Every car maker on Earth is coming for the EV market, because manufacturing most kinds of ICE cars is going to be banned in the future, and they want to remain in business, and will not find it hard to do so.\\n\\nBottom line: if Tesla doesn't start to access new business lines (robotics is a good example) it will start to get its ass kicked in EV, and it will collapse and be remembered as a fad.\\n\\nThat's all the certainty there is. It may go up, but it will certainly go down if it doesn't start reinventing. Getting any num\""
                      ],
                      [
                                            "2021-02-15 20:54:40",
                                            "b\"Right before TSLA made the 1.5B BTC purchase, the price of BTC was hovering at high 30k.\\n\\n\\nI couldn't find a source whether they fully made the purchase  prior to the announcement or after. So let say  TSLA's avg is 40k. 1.5 billion would give them 37.5k Bitcoins.\\n\\nAs of today, it hit 50k just for a slight nano second. The valuation of 37.5k BTC is 1.875 billion at 50k PER...\\n\\n\\nThis doesn't account for the TSLA sales with BTC and also 40k avg i would say falls around the higher average side.\\n\\nTSLA might make more money through BTC than EV sales.\\n\\n\\nEDIT: TSLA got destroyed today RIP\""
                      ],
                      [
                                            "2021-01-08 10:18:10",
                                            "b'Tim: \"Over a five year period, the stock has done nothing\"  \\n\\n\\nCathie:  \"The longer the base, the bigger the break out\"  \\n\\n\\n[https://mobile.twitter.com/DriveTeslaca/status/1347224129938706432](https://mobile.twitter.com/DriveTeslaca/status/1347224129938706432)'"
                      ],
                      [
                                            "2022-12-24 06:07:38",
                                            "b'As always, below represents my opinions and should not be construed as financial advise. Always do you own due dilligence. I welcome your feedback of my opinions.\\n\\n **Company Description**\\n\\no ELI5 the companys business model\\n\\n Tesla primarily designs, develops and manufactures fully electronic vehicles and has a smaller solar generation and battery storage business. They are currently investing into self-driving vehicles and humanoid robots.\\n\\n **Company Soundness**\\n\\no How does the company collect revenue? Does the company have a good or services that is purchased frequently or a regular interval?\\n\\n Tesla sells their products Direct to consumer. Their cars and solar options are purchased directly on their website. Most of the products they sell are durable goods. That is to say they are high ticket items that are often purchased once and without a frequent and recurring interval. Having said that, since Tesla is vertically integrated, they also have the potential to grow a larger s'"
                      ],
                      [
                                            "2023-01-13 15:30:29",
                                            "b'https://www.bloomberg.com/news/articles/2023-01-13/musk-s-bid-to-move-fraud-trial-out-of-san-francisco-is-rejected\\n\\nThe class-action lawsuit alleges Musk harmed investors with this tweet from August 7, 2018: \"Am considering taking Tesla private at $420. Funding secured.\" In another tweet the same day, he wrote, Investor support is confirmed.'"
                      ],
                      [
                                            "2022-06-15 05:28:52",
                                            "b\"I really don't know what to say, if this is madness or not, but its right there on the front-page of ARK Invests website today. \\n\\nImgur Link: [https://imgur.com/a/NAFunRB](https://imgur.com/a/NAFunRB)\\n\\nSo technically buying in on ZOOM & TSLA would be a steal, right? But clearly this seems to reek desperation given the current state of the market.\""
                      ],
                      [
                                            "2022-02-15 02:49:19",
                                            "b\"No emotions, minimum speculations, just raw impartial numbers. We will answer once and for all what is the fair value of TSLA.\\n\\n&#x200B;\\n\\n**Chapter 1. Bull thesis (and other lies I tell myself?)**\\n\\n&#x200B;\\n\\nLet's start with the typical bull thesis. The one you have probably encountered many times in the wilderness of reddit or twitter. It goes like this:\\n\\n&#x200B;\\n\\n* Tesla's car sales will grow 50% annually for foreseeable future. Eventually reaching annual production rate of 20M by 2030. Source: [Technoking himself](https://twitter.com/elonmusk/status/1310486616075579393)\\n\\n&#x200B;\\n\\n* Net margins will stay as high or even grow further from the latest 13.1% (Q4 2021). Commonly cited reasons are 4680, Gigacasting... maybe even Alien Dreadnought?\\n\\n&#x200B;\\n\\n* Tesla is a tech company. They will generate tons of revenue by selling software such as ~~Fraud~~ Full-Self-Driving, and might eventually launch their own marketplace (see AppStore).\\n\\n&#x200B;\\n\\n* Tesla is... *ETF**?* (cannot add a \""
                      ],
                      [
                                            "2021-10-21 07:38:45",
                                            "b'I say all this as a fan of the company. Theyve done amazing things and will continue to amaze us as time goes on with their innovation. Theyre so much more than a car company and anyone who thinks otherwise is a delusional bear. That being said, their stock price hitting 900 is actually ridiculous and is completely detached from reality. Its honestly even a stretch for the best case scenario as we head into the future. \\n\\nOpening this thread to hear some thoughts on whether or not people are trying to build positions at these levels, taking some money off the table, or just holding?'"
                      ],
                      [
                                            "2021-12-26 19:18:47",
                                            "b\"Sold the house and downsized into a nicely located apartment. Wife and I have spent the last two weeks doing our best to understand stocks in general...realized it's not our strongest forte so after maxing our 403b's we have about 30k left for a long term hold. As much as we enjoy being school teachers it's not all bags of cash and rock star fame so doing our best to set up that nest (egg). All our milestones will interestingly happen in 5 year increments: kids to college, then my retirement, then hers. Any thoughts or input is \\\\*greatly\\\\* appreciated, and hope anyone reading this had a super groovy Christmas!  \\n\\n\\nEdit: Went 7 shares GOOGL, 15 VTI, 15 QQQM and then 1k shares on a weed stock for YOLO (S.N.D.L). We are leaving 2 months income in reserve for emergencies and will look at grabbing some TSLA if it takes a notable dip. I love y'all, thank you <3 \""
                      ],
                      [
                                            "2022-12-12 13:03:38",
                                            "b\"Elon is making all of the wrong moves and is becoming more and more hated by the general public. This guy is actually insane and he's causing TSLA stock value to evaporate. However, Tesla's business fundamentals remain unchanged despite his erratic behavior so theoretically, the stock price plummeting is just noise. \\n\\nI'm hoping this is one of those cases where if you're long Tesla, you just hold through the noise and load up on cheap shares due to Elon's repeated bad press. This too shall pass, right?\""
                      ],
                      [
                                            "2021-11-06 18:08:58",
                                            "b'What would the stock ramification be if he were to drop 10% of his position? Could we see institutional investors jumping ship to avoid a loss? A ton of retail investors too?\\n\\nNot gonna lie, I am looking to get out worried about losing significant valuation. Monday morning could be a shit show.\\n\\nOr am I being over dramatic.?\\n\\nEdit: dumb money being over dramatic. Was unaware of any process he would have to go through in order to sell.\\n\\nI am a long term investor and have been for a decent amount of time. Just a newbie hitting a small panic button.'"
                      ],
                      [
                                            "2020-07-15 08:27:53",
                                            "b'Yep you red it right. Im dumb as F. Now if youre on my situation would you let it go and cut the lost or hold?'"
                      ],
                      [
                                            "2022-12-15 08:16:35",
                                            "b\" \\n\\n**Tesla** ([**TSLA**](https://research.investors.com/quote.aspx?symbol=TSLA)) investors are growing tired of Elon Musk's Twitter fiasco. And for good reason.\\n\\nThe 10 largest investors in the electric-vehicle maker's stock, including ETF giants Vanguard, **BlackRock** ([**BLK**](https://research.investors.com/quote.aspx?symbol=BLK)) and [**Musk himself**](https://www.investors.com/etfs-and-funds/etfs/elon-musk-sp500-lost-this-staggering-amount-on-tesla-stock/), lost nearly $133 billion since Twitter's board accepted Musk's buyout on April 25, says an Investor's Business Daily analysis of data from S&P Global Market Intelligence and [**MarketSmith**](https://marketsmith.investors.com/?src=A012BF).\\n\\nIt cost Musk the position as the richest person in the world. But he's not alone feeling the pain.\\n\\n## Tesla Stock Dropping Like A Rock\\n\\nTesla's value is down more than 52% since the Twitter buyout was approved on April 25, while the S&P 500 is only off 5.5%. And Tesla stock is off 29% sinc\""
                      ],
                      [
                                            "2020-09-14 10:01:45",
                                            "b\"At the upcoming Tesla Battery Day conference on September 22, Tesla will officially announce two million-kilometer batteries. If Teslas million-kilometer battery is really realized, electric vehicles will achieve a qualitative leap in mileage and battery life, and battery recycling will also become a thing of the past.\\n\\nSingle crystal cathode battery\\n\\nTesla single crystal cathode battery, this battery is also a lithium ion battery. It uses a new generation of single crystal NMC532 cathodes and a new brand-new electrolyte, which can enable electric vehicles to travel continuously for 1.6 million kilometers. The battery technology we are using can only maintain about 1,000 charge and discharge cycles, and this battery allows 90% of the battery's capacity to maintain a normal level after 4,000 charge and discharge cycles. Therefore, the single-cathode battery can still maintain 90% capacity after achieving 1.6 million kilometers of travel. This also means that if the battery is installed\""
                      ],
                      [
                                            "2019-12-02 02:02:32",
                                            "b\"The Chinese are known for ignoring international copyrights on intellectual property and making knockoff products, in same cases nearly identical to the original but sold at cut throat prices.  Why would Tesla not be concerned about that so much so that they'd build a factory over there? (sorry for poor wording it's 4:30am)\\n\\nEdit: Rather than physical manufacturing of the whole vehicle, I was more thinking about them having access to new battery production techniques (like the Dry process Electrode Fabrication from the Maxwell acquisition), electrical systems, vehicle operation software, AI and related technology.\""
                      ],
                      [
                                            "2018-08-07 10:00:38",
                                            "b'Elon saying he plans to take tesla private at $420 a share? How does this process work with such an out of the blue announcement and does it indicate positive or negative news for the stock?\\n\\n'"
                      ],
                      [
                                            "2021-03-03 12:03:06",
                                            "b'First off. Lmao. Cant tell you how many times Ive been called a boomer for avoiding TSLA and NIO. For the people that are still holding on, good on you.....but the people panicked and selling at a loss, yikes. \\n\\nIts times like this where we learn the most about ourselves. \\n\\n- Ask yourself what youve learned about your risk tolerance. \\n\\n- Ask yourself what lessons youve learned about the reason why you are investing and buying companies. \\n\\nWhen the market goes down or one of my holdings tank. I am often reminded of Peter Lynch. He says that when you buy a company because the returns are good, when the stock goes down people dont know what to do and sell. I feel like this is a lot of yall. Yall bought TSLA and NIO in hopes of 7xing your money...but now that TSLA is down 25% from its ATH, and NIO is down 33%; yall dont know what to do, so you panic and then sell. \\n\\nAbout a month ago, I found this article by Financial Samurai \\n\\nhttps://www.financialsamurai.com/risk-tolerance-is-'"
                      ],
                      [
                                            "2020-11-18 17:18:16",
                                            "b'A helpful fact to note is that NIO cars are popular and that they sell full production capacity of the models they are making so far. That means that their sales are only limited their production capacity, given the demand that exists for their cars. \\n\\n[Nio To Launch Two Back-To-Back Sedans In A Challenge To Tesla Model 3](https://www.benzinga.com/news/20/11/18421371/nio-to-launch-two-back-to-back-sedans-in-a-challenge-to-tesla-model-3)\\n\\n> The Chinese EV maker will launch a sedan \"soon\" and is currently developing another one, Li said without elaborating further on the timeline, as first reported by Bloomberg. So the next two products in line will both be sedans.\\n\\n> The \"Nio Day\" annual event, where the company typically unveils new products and technologies, is slated to happen in January, Nio confirmed to Benzinga last month, and the new sedan launch could come at this time.\\n\\n> The company\\'s sedan offerings are said to be vying to compete with Tesla Inc. \\nTSLA 10.2%\\nModel 3 sedan v'"
                      ],
                      [
                                            "2020-07-22 13:28:06",
                                            "b\" [https://finance.yahoo.com/news/tesla-q2-2020-results-coronavirus-electric-vehicles-170323186.html](https://finance.yahoo.com/news/tesla-q2-2020-results-coronavirus-electric-vehicles-170323186.html) \\n\\nWelp, they did it. I bought my first shares of TSLA today and expected that to jinx earnings but as it turns out they're profitable. Guess the S&P500 is likely to include Tesla at this point, what a world.\""
                      ],
                      [
                                            "2018-10-23 13:26:28",
                                            "b'Tesla shares popped 12.72% today, driven by Citron Research\\'s HUGE shift of opinion in the 9 page document:\\n\\n\"Citron reverses opinion on Tesla. The story has become too compelling to ignore\".\\n\\n(google it to read)\\n\\nTesla also, on almost no notice, pulled their Q3 earnings call forward by a few weeks. It takes place tomorrow after market close.\\n\\nQuestion is, how positive will Tesla\\'s Q3 results be, and how much room does the stock have to move on the results, given the enormous gains made today?\\n\\nIMO, shares pop over $300USD on Q3 results, close 2018 over $300 and never fall below that mark again.... even if Elon Musk does LSD next time he appears on the Joe Rogan podcast.\\n\\nI think in 5-10 years, we\\'ll look back on a $300 2018 stock price and laugh at how ludicrously cheap it was given all the available evidence for future success.\\n\\nFYI, I have a small position in TSLA.'"
                      ],
                      [
                                            "2021-10-10 17:43:25",
                                            "b'I know there will be some comments of people saying that they both are overvalued, blah blah blah. I get it. But if you had to pick between the two which one would it be and why? On a 1-year, 5 year and 10-year time frame. \\n\\nNot financial advice.'"
                      ],
                      [
                                            "2019-03-05 09:07:51",
                                            "b'Store closures, model Y reveal, stock declining. Whats going on with this company? Any thoughts?'"
                      ],
                      [
                                            "2020-08-17 09:29:41",
                                            "b'Previous 52-week ATH was $1794.99 and today it went over that. There is still massive room for growth with the split, battery day and potential inclusion to S&P 500 coming up.'"
                      ],
                      [
                                            "2020-02-09 13:48:13",
                                            "b\" [http://aswathdamodaran.blogspot.com/2020/02/a-do-it-yourself-diy-valuation-of-tesla.html?mc\\\\_cid=d60468097c&mc\\\\_eid=c181c94dc6](http://aswathdamodaran.blogspot.com/2020/02/a-do-it-yourself-diy-valuation-of-tesla.html?mc_cid=d60468097c&mc_eid=c181c94dc6) \\n\\nRightly or wrongly this is one man's evaluation of Tesla.  It caused him to sell on the first big jump to $640.   He makes a great case for $427 (which is why he sold on its first rocket to $640) but has rewritten his valuation so that you can add up the parts and see what you come up with yourself.\\n\\nRather than be a crazy bull or bear, give us your thoughts on these projections and where you think they are too optimistic or to pessimistic.  I have a couple of long dated put contracts at $500, so that may help you with my position.\""
                      ],
                      [
                                            "2020-09-08 06:53:59",
                                            "b'Every week for the past 8 weeks, I\\'ve seen non-stop posts about how people are having great FOMO on TSLA. How they wish they had gotten in at $1000, $1300, $1500, $1750, $2000.\\n\\nEveryone asking about best price to get in, whether it will go higher, etc.\\n\\nWell, now TSLA is down almost 40% from its ATH post-split. Pre-split it was at $2200. Then there was a 5:1 split, which drove the price to $440, at which point it rocketed up to $500 (or $2500 pre-split).\\n\\nNow TSLA has cratered all the way to $340 (or $1700 pre-split). Its back at the price point it was at right after the split was announced. Its still high for some people here, but its trading at a discount from its ATH of $2500.\\n\\nTo all those TSLA FOMO-er\\'s, its time to step up to their conviction. Do you believe in TSLA as the \"company of the future\" that has a valuation potential that can\\'t be captured (ie. ARKK\\'s perspective, and hence their $7000 pre-split price target potential).\\n\\nAdded fun: AMD, BA, MSFT, AAPL are all hammered '"
                      ],
                      [
                                            "2019-05-03 20:32:59",
                                            "b'Risking almost 25k today to buy 98 TSLA stocks at 254.12. \\n\\nMy Hopes:\\n\\n- Game changing EV and battery technology\\n- Elon Musk \\n- Zach Kirkhorn \\n- Supercharger network\\n- Shanghais Gigafactory\\n\\n\\nMy Fears:\\n\\n- Death by wallstreets expectation\\n- Elon Musk (because the one man value to the company is very large)\\n- Chinas tariff on Autonomous system related parts\\n- Competition from guys like Mercedes and BMWs\\n- People losing interest in the product\\n- Powerful short community against TSLA\\n- Falling 50 Day MAr\\n\\nEdit: 7/15/19: After many months of dramatic (but usual for TSLA) movements, I am almost breakeven today. Earnings related swings will be next chapter here.'"
                      ],
                      [
                                            "2022-01-15 09:02:34",
                                            "b\"I wanted to post this since I saw another guy threw up his own TSLA DCF this morning.\\n\\nI work in valuation for a living, so I thought it'd be a good idea to introduce the novice investors on this sub to the valuation and financial modelling GOAT - [Aswath Damodaran of NYU Stern](https://en.wikipedia.org/wiki/Aswath_Damodaran) - who is generally considered the foremost expert on financial valuation theory on plant earth.\\n\\n[Damodaran's most recent TSLA valuation update in November 2021](https://aswathdamodaran.blogspot.com/2021/11/teslas-trillion-dollar-moment-valuation.html)\\n\\n[Tesla 2021 November Valuation DCF Model](https://www.stern.nyu.edu/~adamodar/pc/blog/TeslaNov2021DIY.xlsx)\\n\\n\\nNot only does this guy knows his shit from a technical finance and asset pricing theory-perspective, but he could also honestly probably hang, MS excel-wise, with most of the other juniors I work with.\""
                      ],
                      [
                                            "2023-07-09 20:10:28",
                                            "b'Teslas next earnings report is slated for July 19th with an estimated 46% earnings increase in their share price. What Im unsure of is If I should sell my stock in $RIVN before this happens? \\n\\nThe reason I say this is because I feel this would shift much of the recent attention on Rivian back to Tesla if their stock earnings are good as everyone is hoping to see them hit $300 a share.\\n\\nI feel conflicted because Rivian seems like a promising stock to hold as they are finally starting to get a foothold on the market and turn a profit, plus their truck deal with Amazon. I understand that no one can predict the future of a stock but Im wondering what the general consensus on this Subreddit is.\\n\\nI currently own 1200 shares and bought in at $14\\n\\nEdit: Sold entire position at $25. Going to wait for a dip then buy back'"
                      ],
                      [
                                            "2020-08-21 21:43:40",
                                            "b'On average TSLA has gone up $67.1/day since the announcement of the stock split. Market hours are open 6.5 hours each day. Each hour is about $10.32 so for every minute you spend asking reddit if you should buy, youve lost $0.17/share. Dont question the meme stock. It actually has a product that is in high demand and the stock went nowhere in the previous 10 years (floated around $100-400) and at the time, it was undervalued because 99% of people didnt understand it.\\n\\nEdit: this post is NOT suggesting to buy now. But its also not suggesting to sell or wait for the dip to buy either. Make your own decisions. The risk is very high. If you invest now, it could go up another 5-10% to only drop 30%. No one knows at this point. Theres a lot of catalysts coming up in September like battery day and Q3 earnings. Dont be surprised if we see a sell off before or immediately after. Theres very high expectations for the million mile battery. \\n\\nAs always, do your own research and invest based'"
                      ],
                      [
                                            "2021-01-11 14:25:35",
                                            "b'1) Tesla is volatile. There will be 5%+/- days. \"Back in the day\" we say 10-20% swings. Get use to it.\\n\\n2) Tesla doesn\\'t always go up. Sorry. It had a 11 day green streak. \\n\\n3) Tesla stock doesn\\'t care if you sell now. Someone else will buy your shares for cheaper.\\n\\n4) Tesla is a long term hold. Nothing has changed about the company to justify the sell off but it is due for a correction. In 3-5 years, you\\'ll be grateful you held strong. Before November 2019, this stock traded between $100-$300/share pre-split for YEARS. \\n\\nIf you\\'re still reading this and holding your shares, don\\'t sweat about the down days. Load up more shares if you\\'re invested in this company\\'s future. IMO, on a volatile stock like this I add on every 10%+ drop because you never know how far down it could go.'"
                      ],
                      [
                                            "2022-08-01 10:05:33",
                                            "b'  \\n\\nTeslas stock (TSLA) is surging higher ahead of its shareholders voting on a stock split later this week. The company announced its intentions to do a stock split back in March 2022. And last month, Tesla revealed its intentions for a 3-for-1 stock split, if approved by shareholders. The vote is coming up at Teslas annual shareholders meeting on Thursday, August 4.'"
                      ],
                      [
                                            "2020-02-12 02:45:02",
                                            "b'As the title says - two extreme dips happened to TSLA stock in after hours. Stock is back up same level as yesterday trade now.'"
                      ],
                      [
                                            "2022-05-09 20:41:01",
                                            "b\"I'm being tempted by TSLA at $787, but feel we may see lower of course.\\n\\nI was just reading Barrons and two TSLA bulls have price targets of around $1600 with a 75 forward pe eventually.\\n\\nI remembet last time it got to around $650 and kicking myself for not picking up a couple shares.\\n\\nWould you buy a couple shares at $700 for long term?\\n\\nI currently have 2 shares at $1039 so that would help me average down a bit.\\n\\nI'd definitely add a few at $550 or so if rhe market gets bad enough!\""
                      ],
                      [
                                            "2022-06-03 00:18:44",
                                            "b'Source: https://www.reuters.com/technology/exclusive-musk-says-tesla-needs-cut-staff-by-10-pauses-all-hiring-2022-06-03/\\n\\nSAN FRANCISCO, June 2 (Reuters) - Tesla (TSLA.O) chief executive Elon Musk said he had a \"super bad feeling\" about the economy and that the electric carmaker needed to cut staff by around 10%, according to an internal email seen by Reuters.\\n\\nThe email, titled \"pause all hiring worldwide,\" was sent to Tesla executives on Thursday.\\n\\nTesla was not immediately available for comments.\\n\\nMusk earlier this week asked Tesla employees to return to the office or leave the company.\\n\\n\"Everyone at Tesla is required to spend a minimum of 40 hours in the office per week,\" Musk wrote in another email sent to employees on Tuesday night.\\n\\n\"If you don\\'t show up, we will assume you have resigned.\"'"
                      ],
                      [
                                            "2021-03-24 12:44:05",
                                            "b\"For the past month I've been getting absolutely crushed little by little each day it seems like in every sector.  I feel like I have a pretty well diversified portfolio.  I'm not really heavy on any one particular stock out of the ones below, so I'm not even sure where the majority of the losses are coming from.  I'm still green on most everything but I've given back a lot of gains, these definitely aren't all my investments but a majority of the bigger positions.    \\nTech/Growth:  AAPL, GOOG, PLTR, TSLA, AMZN, AMD, UBER, BABA, JD etc. \\\\~35%  \\nTravel/Rebound (cyclical):  UAL, AAL, OXY, MGM, MAR, NCLH, TRIP, ABNB \\\\~30%  \\nFinancials: WFC, BCS, JPM, BAC\\\\~10%  \\nRetail stocks for stimulus check play:  UAA, NKE, M, LULU, etc.  \\\\~10%  \\nOther positions making up less than 15%   \\n\\n\\nSomehow I've lost about 20% of my portfolio with these names in the last month, it doesn't feel like it but every day it goes down 1 or 2% and that starts to add up.  I know I know, in 5 years who cares but I just wa\""
                      ],
                      [
                                            "2022-12-20 13:40:24",
                                            "b\"Let's do some math. \\n\\nGiven Shanghai's current run rate is 22k per week, that annualizes to a little of 1M per year. Fremont does 600k a year, and I'm estimating Berlin and Austin both do about \\\\~300k next year(Run rate of 75k per quarter at Q1 and then run rate of 500k at end of Q3. That means give or take 300k total). This adds up to 2.2M next year in line with their own 50% yoy growth estimates. \\n\\nKell Blue Book also has the avg selling price of a Tesla in November of 2022 to be 68K. Apparently were supposed to have a recession next year, so let's say Tesla is forced to lower the avg selling price of their vehicle down to 59k. \\n\\nThis would give Tesla about 130B in revenue next year (2.2M \\\\* 59k). Assuming operating margins of 20%, this leaves Tesla with 26B in profit. Divide 26B by the number of shares outstanding, 3.468B, and you get an eps of $7.5. \\n\\nWhat does that make Tesla's forward PE ratio you might ask? Less than Apples. With a share price of $140, Tesla has a forward PE of \""
                      ],
                      [
                                            "2023-06-21 01:14:54",
                                            "b'Not sure if this is the correct forum for this discussion, but how do you all avoid FOMO from such huge rallies? \\n\\nI bought a lot of TSLA on margin at $160 and sold most of my shares at $250. I thought I made out like a bandit. It was the best trade of my life. I used the profits to pay taxes, go on a backpacking trip, close the margin account, and become totally debt free (aside from the mortgage.) \\n\\nHonestly it improved my life significantly. \\n\\nStill, now seeing it rise higher and higher, Ive got FOMO and want to take another margin loan to jump back in for more profits. I reached the goal but keep looking back like I couldve done more. \\n\\nIs this normal? How do you all avoid this feeling?'"
                      ],
                      [
                                            "2021-10-29 02:39:43",
                                            "b'I failed a lot while trading before, during, and after succeeding. I havent counted it up, but its likely I encountered losses in excess of $150,000 from making mistakes that were easily avoided, rash decisions, and not giving myself enough time to test out strategies. Net net, Im up $500,000, but I was asked to share some of what worked for me over IM quite a bit after my last post and figured Id lay it for others who may not want to waste money learning the hard way, as I did. \\n\\nThese are tactics and strategies that worked for me and my situation - someone trying to increase net worth, not increase income - and they may not be suitable for everyone.\\n\\n**Understand the Trading Environment**\\n\\nOne mistake I made more than a few times was not understanding or paying attention to the trading environment I was in before picking out a strategy. What do I mean? I need to know where things are in the year, in relation to earnings season, and in relation to sector rotations. I need to pay a'"
                      ],
                      [
                                            "2021-12-29 12:22:17",
                                            "b'Lately I keep hearing the same old narrative from beat-down investors on r/stocks who are down YTD even when SPY is up 30%: \"everything is down this year, the indexes are just being propped up by mega-cap tech companies like AAPL, TSLA, MSFT, GOOGL, and NVDA\".  They go on to say that just because they are down this year and indexes are up, it\\'s actually not that bad because the mega-caps are hiding the true state of the market.\\n\\nWell, let\\'s look at the data shall we...\\n\\nHere are the YTD gains of a whole bunch of indexes from all the industries that I could think of, most of which don\\'t have many of the aforementioned mega-caps in it:\\n\\nVGT: +32.99% (Technology)  \\nXLF: +34.87% (Financial)  \\nXLE: +47.15% (Energy)  \\nXLI: +22.38& (Industrials)  \\nXLV: +24.99% (Healthcare)  \\nDBC: +43.37% (Commodities)  \\nPAVE: +37.90% (Infrastructure)  \\nAVUV: +42.18 (Small Cap Value)  \\nSCHD: +27.87% (Dividends)  \\nSMH: +43.21% (Semiconductors)  \\nITA: +13.16% (Aerospace and Defense)  \\nTRVL: +6.82% (Travel)\\n\\nAs c'"
                      ],
                      [
                                            "2023-04-19 13:14:35",
                                            "b'Tesla reported earnings after the bell. Here are the results.\\n\\nEarnings per share: 85 cents adj. vs 85 cents expected, according to the average analyst estimate compiled by Refinitiv\\n\\nRevenue: $23.33 billion vs $23.21 billion expected, according to Refinitiv estimates\\n\\nNet income came in at $2.51 billion, down 24% from last year, while GAAP earnings came in at $0.73, down 23% from the year-ago quarter.\\n\\nAutomotive revenue, Teslas core segment, reached $19.96 billion in the quarter.\\n\\nTeslas first-quarter earnings call will be livestreamed via Twitter, a first for the electric vehicle maker. CEO Elon Musk sold billions of dollars worth of his Tesla holdings in 2022 to finance a $44 billion buyout of the social media company, where he is now also CEO.\\n\\nThe company cut prices on its vehicles at the end of last year and into the first quarter of 2023, including additional cuts Tuesday night. At the same time, Tesla is charting ambitious plans for expansion and increased capital expenditur'"
                      ],
                      [
                                            "2018-12-08 07:24:20",
                                            "b'It was 3% off of its all time high early Friday with Jeffries giving them a $450 price tag.   2019 will be the year the shorts finally get destroyed '"
                      ],
                      [
                                            "2018-09-09 07:55:54",
                                            "b\"I've been wanting to drop a substantial amount of money onto TSLA, however many of my peers and redditors told me to wait for a decent price.   \\n\\nI bought in at 259, but I wonder if it has room to drop.  Or should I just hop in now?\\n\\n\\n\\n\\nUpdate:  I bit the bullet and bought in.   Wish me luck!  \\n\\n\\nUpdate2......up 8-9% and I was incredibly fearful when I bought in at $271....however it's at 284.....and I'm a sucker for life. \\n\\nElon...if you could take a few more puffs of the Mary-J....My portfolio would approve so I could purchase more!\""
                      ],
                      [
                                            "2022-10-16 16:18:52",
                                            "b'I have 200 shares of TSLA averaged at $260. I want to put in a Buy order for 200 shares @ $206 for Monday. Then a 200 stock Sell order at @ $225 and at @ $200. I don\\'t do Puts or Calls. Just a simple investor. The fun guys at WSB has a $50 target.  What do you all think here?\\n\\nEdit:  OK. Learned my lesson. $205 to $217 = $12 profit x 200 shares.  The overwhelming negative Tesla comments. Thank you to the few positive comments. Shouldn\\'t have listened to people who said \"wait\". To the keyboard warriors who trashed Tesla and me for playing their stock... you are idiots and I am blocking you all.'"
                      ],
                      [
                                            "2019-07-24 13:57:22",
                                            "b'[https://finance.yahoo.com/news/tesla-reports-2q-2019-results-184241081.html](https://finance.yahoo.com/news/tesla-reports-2q-2019-results-184241081.html)\\n\\n&#x200B;\\n\\nRevenue: $6.35 billion vs. $6.44 billion expected\\n\\nAdj. loss: $1.12 vs. 31 cents per share expected\\n\\n&#x200B;\\n\\nShares (currently) down 8% in AHT'"
                      ],
                      [
                                            "2022-11-09 22:23:40",
                                            "b\"**Edit: right on cue. Musk warns of Twitter bankruptcy:** [https://www.reuters.com/technology/twitter-information-security-chief-kissner-decides-leave-2022-11-10/](https://www.reuters.com/technology/twitter-information-security-chief-kissner-decides-leave-2022-11-10/)\\n\\nOk, there's already a lot that has been said about how negative Twitter has been to TSLA. But I think people are still undestimating just how much worse it can get.\\n\\nTesla investors are definitely pissed at this deal. One, it drives Elon's focus away from Tesla. Two, it forced Elon to sell TSLA. Three, if Twitter can't shore up its cash flow, Elon will likely have to keep selling TSLA to fund Twitter.\\n\\n**Elon's erratic behavior is showing more than ever**\\n\\nI used to think that Elon would make Twitter better. Now I'm not sure. His erratic behavior is showing up more than ever.\\n\\nHe cut half of the engineering staff, realized Twitter needed some fired engineers, while trying to cram untested monetization features into produ\""
                      ],
                      [
                                            "2023-06-21 03:56:13",
                                            "b'Lots of hype lately about the NACS plug standard adoption. Yes, its a good thing to have one type of plug across most/all cars.  Yes, it will potentially generate more revenue for Tesla by increasing demand at super charger stations.  However, I am seeing incredibly high $billion dollar revenue numbers getting thrown around like candy.  Knowing the realization of this NACS adoption is years away and that Tesla has something like 17000 stations in the USA, lets do some math:\\n\\nAssuming each charger is active everyday for 1 year and they are fully utilized at 24 times per day. At their charge rate I was told by others that each charge generates about $25 per.  I think I am being very optimistic and conservative.  \\n\\nSo, I get to about $3.7/3.8B per year in Revenue (not earnings). \\n\\nIf Tesla in 5 years doubled that 17000 in US then of course double that revenue number.  \\n\\nAgain, lots of assumptions and fairly optimistic and conservative.  \\n\\nWhere do all these so called expert analysts get'"
                      ],
                      [
                                            "2021-02-08 05:34:55",
                                            "b'Hello!\\n\\nI went through all the hot posts in popular sub-reddits and selected the top posts for the week. I excluded GME, NOK, AMC because I\\'m sure everyone is experiencing fatigue at the moment on why ThE SquEeZe iS nOt SqUoZe. You might think this is very subjective to what I think is \"popular\" or a quality post, so here were my requirements to be included.\\n\\n1. The post must have reached the hot section at any point during the week.\\n2. Post types that WERE included: news, discussion, due diligence\\n3. Post types that were NOT included: memes, YOLOs, shitposts, gains, losses, etc\\n4. The post was included if it met a certain amount of engagement (upvotes, comments).\\n\\nThese are listed in no particular order. If this is something you guys like I will continue posting this, maybe weekly or bi-weekly.\\n\\n&#x200B;\\n\\n|Post Title|Tickers|\\n|:-|:-|\\n|[AMZN Amazing interview of Jeff Bezos before becoming famous](https://www.reddit.com/r/StockMarket/comments/lba6t3/amzn_amazing_interview_of_jeff_bezos_'"
                      ],
                      [
                                            "2021-06-02 18:12:52",
                                            "b\"I understand that most people in this thread invest safely and aren't willing to risk their money on a risky play like a short squeeze.\\n\\nHowever, I would recommend to everyone to at least acknowledge that a short squeeze is potentially happening, and could potentially continue to happen. What this means is you should be weary of which Hedge Funds are shorting AMC at the moment, AND WHAT THEIR LONG POSITIONS ARE.\\n\\nIf AMC or GME begin to cause Hedge Funds to get margin called and liquidated, we might be in for a flash crash of some of the biggest named stocks.\\n\\nHere are a list of institutional short sellers of AMC: [https://fintel.io/sosh/us/amc](https://fintel.io/sosh/us/amc)\\n\\nHere are their top 10 LONG positions to be aware of:\\n\\n**CITADEL: (Right side is cash value x 1000)**\\n\\nSPY / SPDR S&P 500 ETF Trust\\t25,300,042 (so for instance they have $25.3 Billion in SPY)\\n\\nTSLA / Tesla Motors, Inc.\\t16,340,907\\n\\nTSLA / Tesla Motors, Inc.\\t13,815,397\\n\\nSPY / SPDR S&P 500 ETF Trust\\t13,196,441\\n\\nAMZN /\""
                      ],
                      [
                                            "2022-08-09 18:59:01",
                                            "b'Elon Musk sold nearly $7 billion worth of Tesla Inc. TSLA -2.44% stock in recent days, regulatory disclosures show, just months after saying he wasnt planning to sell additional shares in the company.\\n\\nMr. Musk sold around 7.9 million shares between Friday and Tuesday, regulatory filings show.\\n\\nhttps://www.wsj.com/articles/elon-musk-sells-nearly-7-billion-worth-of-tesla-stock-11660096215?mod=breakingnews'"
                      ],
                      [
                                            "2018-09-27 14:00:49",
                                            "b\"i sold roughly 30% of my shares of TSLA yesterday as it rallied, I was thinking about it earlier today but I didn't pull the trigger. I feel that TSLA will definitely drop sub $250 tomorrow. Anyone else think so?\\n________\\n\\nAlso, how long do these proceedings last? Could it be years before there's a judgment made? or is he clearly guilty?\""
                      ],
                      [
                                            "2020-07-15 09:22:42",
                                            "b\"Not a true DD, but here is why I think NIO is better than SOLO and TSLA.\\n\\nA) china wants to be less reliant on foreign oil\\n\\nB) chinas two biggest cities (Beijing and shanghai) are covered in smog\\n\\nC) to get a license in one of these big cities, one has to enter a lottery. If you own an EV vehicle then you get the license automatically without entering the lottery\\n\\nD) NIO is the biggest EV company in china and was recently given 1.5 billion credit from chinese banks and recent production reports have been positive\\n\\nE) anecdotally, I believe china likes monopolies because it's easier for them to control. So signs point to NIO being the one they back\\n\\nF) NIO cars are much better looking than SOLO and comparable to tesla. \\n\\nG)  I think I am supposed to put this in here.\""
                      ],
                      [
                                            "2020-09-23 11:08:56",
                                            "b'https://www.sfchronicle.com/politics/article/California-to-ban-sale-of-new-gas-only-cars-in-15591347.php\\n\\nGood sign for Electric Vehicle stocks. Hopefully other states follow suit. There will be some huge opportunities for TSLA, Lordstown, etc... not to mention Hyliion, Chargepoint, Workhrse and other up and coming EV related companies.\\n\\nWe should see a quick race for current automakers to ramp up EV technology and production. Interested to see which established companies will succeed versus newer EV companies on the market.'"
                      ],
                      [
                                            "2022-12-24 07:05:55",
                                            "b'A lot of posts about folks dumping Tesla. Here are some counter points. I welcome feedback! Please be civil. \\n\\n1.\\tI sincerely doubt people are shying away from Tesla because of Elon. Even if they are, it is a short term phenomenon because of his involvement in Twitter. Like all stupid forays, this foray will come to an end as well and money will rush back in again. \\n\\n2.\\tTesla makes great cars. Buyers remorse is almost non existent. People love their cars, flaws and all! There isnt a car that is anywhere close to it from a technology perspective. (you may debate this - but find me a car that has a greater range + capabilities)\\n\\n3.\\tTesla does not spend a dime on advertising! Just think of the brand awareness and consideration this company has without spending a dime on advertising. Others are spending billions! Even Porsche who I think is the closest competition has billboards all over the place!\\n\\n4.\\tThey are profitable! This is not a smoke and mirror show. Maybe you say that the autopi'"
                      ],
                      [
                                            "2022-01-10 12:36:50",
                                            "b'TSLA dropped below $1,000 today, I believe to $980, and popped back up. Anyone else tracking this and making a buy? Seems like that 1k support is pretty reliable. The last time I saw it bounce at 1k was 2.5 weeks ago.'"
                      ],
                      [
                                            "2023-01-26 22:08:18",
                                            "b\"Strong Q4 earnings and the possibility of producing up to 2 million cars this year helped add to Teslas recent gains. The stock closed nearly 11% higher on Thursday after already breaking the downtrend resistance stemming back to September at the start of the week. \\n\\nThe gap higher does leave some room for a pullback on profit-taking from here, especially if Fridays inflation data raises bets for a hawkish Fed decision next week. However, trading volume has been relatively higher around the recent lows, including Monday's breakout, potentially signalling strong demand at the current levels. \\n\\nAll trading involves risk, but the stock could begin a more sustained rebound if the strong earnings report, and Elon Musks comments on demand and output attracts longer-term investors.\""
                      ],
                      [
                                            "2018-03-28 09:56:30",
                                            "b'Elon stated \"I am increasingly concerned about SpaceX going public before the Mars transport system is in place. Creating the technology needed to establish life on Mars is and always has been the fundamental goal of SpaceX. If being a public company diminishes that likelihood, then we should not do so until Mars is secure. \"\\n\\nIt\\'s true, look at us we are all bashing the future.  Tesla has solved a lot of problems, but is now hated, and ask for what?  Becuase some hedge funds pulled out and are manipulating the price painting a bad picture on TSLA.  Then later buy it back, and paint a fucking Bob Ross landscape of the most beautiful company to invest in.  So it\\'s not fuck TSLA it\\'s fuck the Hedge funds.'"
                      ],
                      [
                                            "2023-01-18 05:07:09",
                                            "b'Jan 17 [Reuters](https://www.reuters.com/technology/tesla-video-promoting-self-driving-was-staged-engineer-testifies-2023-01-17/?utm_source=reddit.com) - \"A 2016 video that Tesla (TSLA.O) used to promote its self-driving technology was staged to show capabilities like stopping at a red light and accelerating at a green light that the system did not have, according to testimony by a senior engineer.\\n\\nThe video, which remains archived on Teslas website, was released in October 2016 and promoted on Twitter by Chief Executive Elon Musk as evidence that Tesla drives itself.\\n\\nTo create the video, the Tesla used 3D mapping on a predetermined route from a house in Menlo Park, California, to Teslas then-headquarters in Palo Alto, he said.\\n\\nDrivers intervened to take control in test runs, he said. When trying to show the Model X could park itself with no driver, a test car crashed into a fence in Teslas parking lot, he said.\\n\\nThe intent of the video was not to accurately portray what was a'"
                      ],
                      [
                                            "2022-11-10 19:11:25",
                                            "b' \\n\\nTwitter\\'s new owner Elon Musk, who is also CEO of electric vehicle maker [Tesla](https://www.cnbc.com/quotes/TSLA/) and U.S. defense contractor SpaceX, told employees of the social media business on Thursday that he recently sold shares of Tesla to \"save Twitter.\"\\n\\nHe made the remarks during an all-hands meeting that he hosted in part to motivate Twitter employees who remain after sweeping layoffs to work hard. Musk let go of about half of Twitter employees following his acquisition of the company for $44 billion, or $54.20 per share.\\n\\n[As CNBC previously reported,](https://www.cnbc.com/elon-musk/) to finance his portion of that take-private deal, last week Musk sold at least another $3.95 billion worth of [Tesla](https://www.cnbc.com/quotes/TSLA/)stock. According to filings with the Securities and Exchange Commission published Tuesday, the batch of shares he just sold amounted to 19.5 million more shares of Tesla.\\n\\nEarlier this year, he also sold over $8 billion worth ofTesla sto'"
                      ],
                      [
                                            "2020-11-28 14:10:28",
                                            "b\"Should we be worried? I'm betting on TSLA's AI being unmatched, but production-wise I'm not too sure of the outcome if the traditional makers go all-in on EVs. Especially since they're all making joint venture factories with LG Chem, CATL, Panasonic etc.\""
                      ],
                      [
                                            "2019-10-27 18:58:44",
                                            "b'\"On Wednesday, the auto maker reported adjusted third-quarter **earnings** per share of $1.86, which was down from $2.90 in the prior year, but way above the 46 cent loss expected by Wall Street. **Tesla** generated revenue of $6.3 billion for the quarter, versus the $6.4 billion estimate.\"'"
                      ],
                      [
                                            "2021-11-01 11:55:24",
                                            "b\"Warning: this is not a post to justify valuation of TSLA.\\n\\nI've learned this past year that retail traders don't really make a dent on a stock price. It's the institutions that make the stock price move. If so, who's constantly buying up TSLA and driving the price up?  Is it possible that TSLA is getting squeezed?\""
                      ],
                      [
                                            "2023-01-03 16:47:56",
                                            "b'Over the last year $TSLA (one of the most innovative and efficient companies in the world) has now fallen almost 73% \\n\\nHowever $LULU (a retail brick and mortar store that sells over priced sweat pants) is only down 16.5% in this same time frame. \\n\\nQuestion is.. is $LULU the greatest short position or is $TSLA the greatest long? \\n\\nPerhaps both? I think both. Hbu?'"
                      ],
                      [
                                            "2018-03-31 20:13:06",
                                            "b\"The past week as you probably know, has been terrible for Tesla stock. One bad news after another. Its now pretty much a given that on Monday the stock price will go down. I hold quite a bit of TSLA (I know stupid of me) and have a sizable paper loss. \\n\\nWhat do you think should I do given this scenario ? Sell immediately when markets open on Monday and cut my losses ? Hold and wait for Tesla's production news, which do not seem to look good anyways ? Hold long for a few months ? \\n\\nAs usual market analysts have differing views on the stock. Some are still bullish and continue to maintain their target price and advice to buy/hold, and some are screaming its over - sell, sell ! In the meanwhile Tesla and Elon Musk are strangely quiet. Does Elon have a rabbit up his sleeve or is he too in a quandary, is difficult to know.\\n\\nPlease provide me serious advice. Everyone makes mistakes in the stock market. I probably made a big one. I don't know.\\n\\nEdit: I will definitely take my own decision and\""
                      ],
                      [
                                            "2020-07-08 15:56:35",
                                            "b\"Hi all. Today I officially closed out my Tesla position at least for the time being. For me the price has gotten to high for my personal comfort level so I sold my last 2 shares and I feel fine about it. Here is a story of my 1 year ride on the Tesla coaster. \\n\\nMy first purchase was 5 shares back in June of 2019 @ a price of $220 a share. I work in the solar industry and was seeing how many power walls my company was installing to pair with solar projects. I also was noticing more and more Tesla's on the road and this is what swayed my decision to jump into what at the time was considered a bad stock. By July the stock was up to $260 and I was feeling great about my investment. Earning were just around the corner so I decided to hold and see what happens. It did not go well. The stock dropped right back to my purchase price and even dipped below a few times. I stuck with it because I believed in the company and my position never got to -10% which is a rule I try to follow and cut loses\""
                      ],
                      [
                                            "2021-12-30 07:17:56",
                                            "b'https://www.reuters.com/business/autos-transportation/tesla-recalls-over-475000-electric-vehicles-2021-12-30/\\n\\nDec 30 (Reuters) - Tesla Inc (TSLA.O) is recalling more than 475,000 of its Model 3 and Model S electric cars to address rearview camera and trunk issues that increase the risk of crashing, the U.S. road safety regulator said.\\n\\nTesla shares were down 1.1% in premarket trading on Thursday.\\n\\nThe U.S. electric vehicle manufacturer is recalling 356,309 2017-2020 Model 3 vehicles to address rearview camera issues and 119,009 Model S vehicles due to front hood problems, the National Highway Traffic Safety Administration (NHTSA) said.\\n\\nThe total number of recalled vehicles is close to the half a million vehicles Tesla delivered last year. Tesla could not be reached for comment.'"
                      ],
                      [
                                            "2019-12-19 06:58:57",
                                            "b'Title says all - Im a believer in TSLA in the long term but its at an ATH right now, yes it could always go higher but I feel like a pull back would be healthy. Im considering selling my position and re entering when its near previous support - what say you on the matter? \\n\\nI got in at 212 btw and now its at about 399'"
                      ],
                      [
                                            "2018-09-30 05:51:18",
                                            "b'Just a quick reminder, since Tsla dropped more than 10% on Friday the uptick rule is still in effect Monday meaning shorts cant sell at market.  This will make Mondays rally extra spicy. '"
                      ],
                      [
                                            "2021-01-17 05:13:12",
                                            "b'I created an algo that scans the most popular trading sub-reddits and logs the tickers mentioned in due-diligence or discussion-styled posts. Instead of scanning for how many times each ticker was mentioned in a comment, I logged how popular the post was among the sub-reddit. Essentially if it makes it to the \\'hot\\' page, regardless of the subreddit, then it will most likely be on this list. There are two parts to this post. The first is for posts that were submitted in the most active trading sub-reddits (such as this one), and the second part has the most mentioned tickers from the WSB sub-reddit.\\n\\n**How is \"Hype\" calculated?**\\n\\nWell, this is a little tricky but it\\'s based on the engagement that the post received in that sub-reddit relative to other posts in the same sub-reddit\\n\\n**How can I use this list?**\\n\\nThe best way to use this data is to learn about new tickers that might be trending. As an example, I probably would have never known about the ARK etfs, or even Palantir, until th'"
                      ],
                      [
                                            "2021-02-01 18:52:09",
                                            "b\"Hello all,\\n\\nIf you don't recognize my name then perhaps you haven't seen my posts at the start of all this. You can find the original DD [here](https://www.reddit.com/r/stocks/comments/k688qv/for_those_who_dont_understand_the_inevitable/?utm_source=share&utm_medium=web2x&context=3) and the pre-earnings assumptions [here](https://www.reddit.com/r/stocks/comments/k3p4bc/when_will_the_gme_squeeze_happen_answers_here/?utm_source=share&utm_medium=web2x&context=3).\\n\\nThings looked bad today, and truthfully I'm surprised and proud that it took this long for us to have a red day. At one point last week the stock plummeted to $120 and everyone seemingly forgets that detail simply because it quickly rebounded. It dropped all the way down nonetheless when trading restrictions were imposed.\\n\\nNow, let's talk about that day. Why did it go down? That is easy, insane trading restrictions especially on RH where the majority shareholders place trades.\\n\\nBut what's interesting to examine is...why did it go\""
                      ]
]